tap "dimentium/autoraise"

# ========================================
# 📟 Terminal
# ========================================
# Terminal emulator
cask "alacritty"
# Terminal multiplexer
brew "tmux"

# ========================================
# 🛠️ Shell Utilities
# ========================================
# Alternative to cat(1)
brew "bat"
# Alternative to find(1)
brew "fd"
# Fuzzy finder
brew "fzf"
# Alternative to grep(1)
brew "ripgrep"
# Simplified, community-driven man pages
brew "tlrc"
# Display directories as trees
brew "tree"

# ========================================
# 🕹 CLI Tools
# ========================================
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# A youtube-dl fork to download audio/video from YouTube and other sites
brew "yt-dlp"
# Quickly generate a disposable email using mail.tm API
brew "mailsy"
# Reverse proxy from a public endpoint to localhost
brew "ngrok"
# Password generator
brew "pwgen"
# RAR Archiver
cask "rar"
# 7-Zip archiver
brew "sevenzip"
# Internet file retriever
brew "wget"

# ========================================
# 📦 Languages & Runtimes
# ========================================
# AWS Cloud Development Kit - framework for defining AWS infra as code
brew "aws-cdk"
# Official Amazon AWS command-line interface
brew "awscli"
# GNU compiler collection
brew "gcc"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Platform built on V8 to build network applications
brew "node"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Python environment management
brew "pyenv"
# Development kit for the Java programming language
brew "openjdk@25"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@21"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@17"
# JavaScript package manager
brew "yarn"

# ========================================
# 🧰 GUI Tools
# ========================================
# Application uninstaller
cask "appcleaner"
# Focus-follows-mouse
cask "autoraiseapp"
# Utility that prevents the system from going to sleep
cask "caffeine"
# Shows the next meeting in the menu bar
cask "meetingbar"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Unpacks archive files
cask "the-unarchiver"

# ========================================
# 🧑‍💻 Dev Apps
# ========================================
# JetBrains tools manager
cask "jetbrains-toolbox"
# Replacement for Docker Desktop
cask "orbstack"
# Collaboration platform for API development
cask "postman"
# Open-source code editor
cask "visual-studio-code"
# Multiplayer code editor
cask "zed"

# ========================================
# 🖥️ General Apps
# ========================================
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# App to write, plan, collaborate, and get organised
cask "notion"
# Control your tools with a few keystrokes
cask "raycast"
# Music streaming service
cask "spotify"
# Video communication and virtual meeting platform
cask "zoom"

# ========================================
# 🔌 VS Code Plugins
# ========================================
vscode "golang.go"
vscode "ms-vscode.cpptools"
vscode "ritwickdey.liveserver"
