tap "dimentium/autoraise"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"

# ========================================
# 📦 Languages & Runtimes
# ========================================
# AWS Cloud Development Kit - framework for defining AWS infra as code
brew "aws-cdk"
# Official Amazon AWS command-line interface
brew "awscli"
# GNU compiler collection
brew "gcc"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Platform built on V8 to build network applications
brew "node"
# Development kit for the Java programming language
brew "openjdk@21"
# JavaScript package manager
brew "yarn"

# ========================================
# 🛠️ CLI Tools
# ========================================
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Quickly generate a temporary email address
brew "mailsy"
# Reverse proxy, secure introspectable tunnels to localhost
brew "ngrok"
# Password generator
brew "pwgen"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Internet file retriever
brew "wget"
# Display directories as trees (with optional color/HTML output)
brew "tree"

# ========================================
# 🧰 GUI Utilities
# ========================================
# Application uninstaller
cask "appcleaner"
# Focus-follows-mouse
cask "autoraiseapp"
# Utility that prevents the system from going to sleep
cask "caffeine"
# Shows the next meeting in the menu bar
cask "meetingbar"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Window manager
cask "tiles"
# Unpacks archive files
cask "the-unarchiver"

# ========================================
# 🧑‍💻 Dev Apps
# ========================================
# JetBrains tools manager
cask "jetbrains-toolbox"
# Replacement for Docker Desktop
cask "orbstack"
# Collaboration platform for API development
cask "postman"
# Open-source code editor
cask "visual-studio-code"
# Multiplayer code editor
cask "zed"

# ========================================
# 🖥️ General Apps
# ========================================
# Web browser
cask "google-chrome"
# App to write, plan, collaborate, and get organised
cask "notion"
# Music streaming service
cask "spotify"
# Video communication and virtual meeting platform
cask "zoom"

# ========================================
# 🔌 VS Code Plugins
# ========================================
vscode "golang.go"
vscode "ms-vscode.cpptools"
vscode "ritwickdey.liveserver"
