# ========================================
# 🔠Fonts
# ========================================
cask "font-jetbrains-mono-nerd-font"

# ========================================
# 📟 Terminal
# ========================================
cask "alacritty"
brew "tmux"

# ========================================
# 🛠️ Shell Utilities
# ========================================
# Alternative to cat(1)
brew "bat"
# Pager for diff(1) & git(1)
brew "delta"
# Alternative to find(1)
brew "fd"
# Fuzzy finder
brew "fzf"
# Tool for glamorous shell scripts
brew "gum"
# Alternative to grep(1)
brew "ripgrep"
# Simplified, community-driven man pages
brew "tlrc"
# Display directories as trees
brew "tree"

# ========================================
# 📦 Languages & Runtimes
# ========================================
brew "awscli"
brew "git"
brew "go"
brew "libpq"
brew "mvn"
brew "node"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Python environment management
brew "pyenv"
cask "temurin@25"
cask "temurin@21"
cask "temurin@17"
brew "yarn"

# ========================================
# 🕹 CLI Tools
# ========================================
# Select default apps for documents and URL schemes on macOS
brew "duti"
# macOS CLI for managing custom icons for files and folders
brew "fileicon"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GitHub command-line tool
brew "gh"
# A youtube-dl fork to download audio/video from YouTube and other sites
brew "yt-dlp"
# Quickly generate a disposable email using mail.tm API
brew "mailsy"
# Reverse proxy from a public endpoint to localhost
cask "ngrok"
# Password generator
brew "pwgen"
# RAR Archiver
cask "rar"
# 7-Zip archiver
brew "sevenzip"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Internet file retriever
brew "wget"

# ========================================
# 🧰 GUI Tools
# ========================================
cask "monitorcontrol"
cask "the-unarchiver"

# ========================================
# 🖥️ Apps
# ========================================
cask "chatgpt"
cask "google-chrome"
cask "google-drive"
cask "notion"
cask "raycast"
cask "spotify"
cask "vlc"
cask "zoom"

# ========================================
# 🧑‍💻 Dev Apps
# ========================================
cask "jetbrains-toolbox"
cask "intellij-idea"
cask "datagrip"
cask "goland"
cask "orbstack"
cask "postman"
cask "visual-studio-code"

# ========================================
# 🔌 VS Code Plugins
# ========================================
# C/C++ language support
vscode "ms-vscode.cpptools"
# Go language support
vscode "golang.go"
# Java language support
vscode "redhat.java"
# Unofficial PHP language support
vscode "DEVSENSE.phptools-vscode"
vscode "bmewburn.vscode-intelephense-client"
# Python language support
vscode "ms-python.python"
# TypeScript Next features
vscode "ms-vscode.vscode-typescript-next"
# XML language support
vscode "redhat.vscode-xml"
# YAML language support
vscode "redhat.vscode-yaml"
# TOML language support
vscode "tamasfe.even-better-toml"
# Docker support
vscode "docker.docker"
# Prettier code formatter
vscode "esbenp.prettier-vscode"
# Unofficial shell script formatter
vscode "lumirelle.shell-format-rev"
# Binary Plist viewer and editor
vscode "dnicolson.binary-plist"
# Live server for static & dynamic pages
vscode "ritwickdey.liveserver"
# GitHub Copilot inline coding suggestions
vscode "github.copilot"
# GitHub Copilot chat
vscode "github.copilot-chat"
# Color theme
vscode "saltanovas.theme-darcula-intellij"
# Icon theme
vscode "chadalen.vscode-jetbrains-icon-theme"
# Product theme
vscode "antfu.icons-carbon"
